[
  {
    "topic": "How comes some fruits are toxic? Atropa belladonna comes to mind.",
    "score": 0.8,
    "hook": "How comes some fruits are toxic? Atropa belladonna comes to mind. - trending on reddit",
    "keywords": [
      "AskScience"
    ],
    "created_at": "2025-08-12"
  },
  {
    "topic": "Are there any species of plants that would typically be considered weeds/invasive, that naturally adapted to become more appealing to humans, to avoid being removed?",
    "score": 0.8,
    "hook": "Are there any species of plants that would typically be considered weeds/invasive, that naturally adapted to become more appealing to humans, to avoid being removed? - trending on reddit",
    "keywords": [
      "AskScience"
    ],
    "created_at": "2025-08-12"
  },
  {
    "topic": "Mapping the surface of Venus?",
    "score": 0.8,
    "hook": "Mapping the surface of Venus? - trending on reddit",
    "keywords": [
      "AskScience"
    ],
    "created_at": "2025-08-12"
  },
  {
    "topic": "How did the larger major moons of the Solar System form around Gas Giants, and why are they so different from the smaller irregular moons?",
    "score": 0.8,
    "hook": "How did the larger major moons of the Solar System form around Gas Giants, and why are they so different from the smaller irregular moons? - trending on reddit",
    "keywords": [
      "AskScience"
    ],
    "created_at": "2025-08-12"
  },
  {
    "topic": "At what point do “invasive species” become just part of the ecosystem?  Has it already happened somewhere?",
    "score": 0.8,
    "hook": "At what point do “invasive species” become just part of the ecosystem?  Has it already happened somewhere? - trending on reddit",
    "keywords": [
      "AskScience"
    ],
    "created_at": "2025-08-12"
  },
  {
    "topic": "Why is Pluto’s orbit so strange compared to the other planets, and what does it say about the early solar system?",
    "score": 0.8,
    "hook": "Why is Pluto’s orbit so strange compared to the other planets, and what does it say about the early solar system? - trending on reddit",
    "keywords": [
      "AskScience"
    ],
    "created_at": "2025-08-12"
  },
  {
    "topic": "Male authors have higher retraction rates than female peers, with patterns varying by discipline and country, a study of over 20 million papers has found.",
    "score": 0.8,
    "hook": "Male authors have higher retraction rates than female peers, with patterns varying by discipline and country, a study of over 20 million papers has found. - trending on reddit",
    "keywords": [
      "science"
    ],
    "created_at": "2025-08-12"
  },
  {
    "topic": "Evidence of a 12,800-year-old Shallow Airburst Depression in Louisiana with Large Deposits of Shocked Quartz and Melted Materials",
    "score": 0.8,
    "hook": "Evidence of a 12,800-year-old Shallow Airburst Depression in Louisiana with Large Deposits of Shocked Quartz and Melted Materials - trending on reddit",
    "keywords": [
      "science"
    ],
    "created_at": "2025-08-12"
  },
  {
    "topic": "Leaf-inspired bioplastic - Chemical engineers introduce cellulose nanofibers to design of a starch-derived plastic, improving strength & biodegradability. It has low air or water permeability which helps keep food stable, and has a printable surface which negates need for separate packaging labels.",
    "score": 0.8,
    "hook": "Leaf-inspired bioplastic - Chemical engineers introduce cellulose nanofibers to design of a starch-derived plastic, improving strength & biodegradability. It has low air or water permeability which helps keep food stable, and has a printable surface which negates need for separate packaging labels. - trending on reddit",
    "keywords": [
      "science"
    ],
    "created_at": "2025-08-12"
  },
  {
    "topic": "Cats with dementia have brain changes similar to those of people with Alzheimer’s disease, offering a valuable model for studying the condition in humans",
    "score": 0.8,
    "hook": "Cats with dementia have brain changes similar to those of people with Alzheimer’s disease, offering a valuable model for studying the condition in humans - trending on reddit",
    "keywords": [
      "science"
    ],
    "created_at": "2025-08-12"
  },
  {
    "topic": "Brain cells learn faster than machine learning, new research reveals",
    "score": 0.8,
    "hook": "Brain cells learn faster than machine learning, new research reveals - trending on reddit",
    "keywords": [
      "science"
    ],
    "created_at": "2025-08-12"
  },
  {
    "topic": "A new study found that rapeseed, wheat, and peas grown in Canada emit far less CO₂ than those from major competitors, even after shipping overseas.",
    "score": 0.8,
    "hook": "A new study found that rapeseed, wheat, and peas grown in Canada emit far less CO₂ than those from major competitors, even after shipping overseas. - trending on reddit",
    "keywords": [
      "science"
    ],
    "created_at": "2025-08-12"
  },
  {
    "topic": "Smartwatches are useless for measuring actual stress levels, study says | Researchers found little correlation existed between the data and the participants' personal experience. None of the 800 subjects got a \"stress score\" on their tracker that matched the level of stress they were feeling.",
    "score": 0.8,
    "hook": "Smartwatches are useless for measuring actual stress levels, study says | Researchers found little correlation existed between the data and the participants' personal experience. None of the 800 subjects got a \"stress score\" on their tracker that matched the level of stress they were feeling. - trending on reddit",
    "keywords": [
      "science"
    ],
    "created_at": "2025-08-12"
  },
  {
    "topic": "Exercise Can Help Fight Breast Cancer, Experiments Show",
    "score": 0.8,
    "hook": "Exercise Can Help Fight Breast Cancer, Experiments Show - trending on reddit",
    "keywords": [
      "science"
    ],
    "created_at": "2025-08-12"
  },
  {
    "topic": "The human brain ages less than thought and in layers – at least in the area of the cerebral cortex responsible for the sense of touch",
    "score": 0.8,
    "hook": "The human brain ages less than thought and in layers – at least in the area of the cerebral cortex responsible for the sense of touch - trending on reddit",
    "keywords": [
      "science"
    ],
    "created_at": "2025-08-12"
  },
  {
    "topic": "Non-mRNA vaccine targeting common mutations in pancreatic and bowel cancers could lower risk of relapse | Lymph node-targeted, mKRAS-specific amphiphile vaccine in pancreatic and colorectal cancer: phase 1 AMPLIFY-201 trial final results",
    "score": 0.8,
    "hook": "Non-mRNA vaccine targeting common mutations in pancreatic and bowel cancers could lower risk of relapse | Lymph node-targeted, mKRAS-specific amphiphile vaccine in pancreatic and colorectal cancer: phase 1 AMPLIFY-201 trial final results - trending on reddit",
    "keywords": [
      "science"
    ],
    "created_at": "2025-08-12"
  },
  {
    "topic": "Tropical bird populations have dropped by a third since 1980 due to intensifying heat extremes, with some species declining by over 50%. They now face ten times more extreme heat than forty years ago — from an average of three days per year to thirty.",
    "score": 0.8,
    "hook": "Tropical bird populations have dropped by a third since 1980 due to intensifying heat extremes, with some species declining by over 50%. They now face ten times more extreme heat than forty years ago — from an average of three days per year to thirty. - trending on reddit",
    "keywords": [
      "science"
    ],
    "created_at": "2025-08-12"
  },
  {
    "topic": "New results from the BOHEMIA trial in Kenya show that mass administration of ivermectin significantly reduces malaria transmission. New infections were reduced by 26% in children aged 5-15 with high bed net compliance compared to the control drug albendazole.",
    "score": 0.8,
    "hook": "New results from the BOHEMIA trial in Kenya show that mass administration of ivermectin significantly reduces malaria transmission. New infections were reduced by 26% in children aged 5-15 with high bed net compliance compared to the control drug albendazole. - trending on reddit",
    "keywords": [
      "science"
    ],
    "created_at": "2025-08-12"
  },
  {
    "topic": "New computer chip in the Large Hadron Collider will allow a observation of 1.5 billion collisions per second",
    "score": 0.8,
    "hook": "New computer chip in the Large Hadron Collider will allow a observation of 1.5 billion collisions per second - trending on reddit",
    "keywords": [
      "science"
    ],
    "created_at": "2025-08-12"
  },
  {
    "topic": "LLMs applied in long-term care are prone to downplay women's health issues",
    "score": 0.8,
    "hook": "LLMs applied in long-term care are prone to downplay women's health issues - trending on reddit",
    "keywords": [
      "science"
    ],
    "created_at": "2025-08-12"
  }
]